#ifndef ENTRADA_MICROFONO_H
#define ENTRADA_MICROFONO_H

#include <Arduino.h>


// ============================================================
// INICIALIZACIÓN
// ============================================================

void entrada_microfono_init();


// ============================================================
// DISPONIBILIDAD
// ============================================================
//
// Devuelve el número de bloques disponibles.
//
// ============================================================

uint16_t entrada_microfono_disponible();


// ============================================================
// LEER BLOQUE
// ============================================================
//
// Devuelve un puntero a un bloque de 128 muestras.
//
// ============================================================

int16_t* entrada_microfono_leer();


// ============================================================
// LIBERAR BLOQUE
// ============================================================

void entrada_microfono_liberar();

#endif